       IDENTIFICATION DIVISION.
       PROGRAM-ID. USERS.
	   AUTHOR. 	KASKA MISKOLCZI.
      *>********************************************************************************
      *>  Program reads a file containing users' yearly sales info & prints report  *
      *>********************************************************************************

       ENVIRONMENT DIVISION.
	   CONFIGURATION SECTION.
	   SOURCE-COMPUTER. 
	   OBJECT-COMPUTER.
	   
       INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
			SELECT USERSFILE ASSIGN TO "USERS.DAT"
			ORGANIZATION IS SEQUENTIAL.
			SELECT PRINT-FILE ASSIGN TO "USERSREPORT.DAT".
             
               
       DATA DIVISION.
       FILE SECTION.
	   FD USERSFILE.

	   01 USERSDETAILS.
			88 ENDOFUSERS VALUE HIGH-VALUES.
			05 USERSPERSON-ID  	PIC 9(5).
			05 USERSPERSON-NAME.
				10 LASTNAME	 	PIC X(30).
				10 FIRSTNAME 	PIC X(30).
			05 REGION			PIC X(5). 
			05 YEARLYUSERS	PIC 9(6).
			05 GENDER		PIC X.
			
	    FD PRINT-FILE.

		01  PRINT-LINE		PIC X(132).
   
		WORKING-STORAGE SECTION.
		01   WS-TOTAL-USERS	PIC 9(10).
		01   WS-REGION-USERS.
             05 WS-EAST			PIC 9(7) VALUE ZEROES.
             05 WS-WEST			PIC 9(7) VALUE ZEROES.
             05 WS-NORTH		PIC 9(7) VALUE ZEROES.
             05 WS-SOUTH		PIC 9(7) VALUE ZEROES.

        01  HEADING-LINE.
            05 FILLER	        PIC X(5) VALUE SPACES.
            05 FILLER	        PIC X(16) VALUE 'USERSPERSON NAME'.
            05 FILLER	        PIC X(10) VALUE SPACES.
            05 FILLER	        PIC X(6)  VALUE 'REGION'.
            05 FILLER	        PIC X(10) VALUE SPACES.
            05 FILLER 	        PIC X(12) VALUE 'YEARLY USERS'.
            05 FILLER	        PIC X(73) VALUE SPACES.
			
		01  DETAIL-LINE.
			05 FILLER           PIC X(5)  VALUE SPACES.
			05 DET-FNAME        PIC X(30).
			05 FILLER           PIC X(10)  VALUE SPACES.
			05 DET-LNAME        PIC X(30).
			05 FILLER           PIC X(10)  VALUE SPACES.
			05 DET-REGION       PIC X(6).
			05 FILLER           PIC X(10)  VALUE SPACES.
			05 DET-YEARLYUSERS  PIC X(12).
			05 FILLER           PIC X(19)  VALUE SPACES.
			
		01  TOTAL-LINE.
			05 FILLER	        PIC X(5)   VALUE SPACES.
			05 FILLER           PIC X(16)  VALUE SPACES.
			05 FILLER           PIC X(10)  VALUE SPACES.
			05 FILLER           PIC X(6)   VALUE SPACES.
			05 FILLER           PIC X(10)  VALUE SPACES.
			05 TOTAL-YRLY-USERS PIC X(12).
			05 FILLER           PIC X(73)  VALUE SPACES.

		PROCEDURE DIVISION.
		
		0050-OPEN-FILE.
	       OPEN INPUT USERSFILE.
		   OPEN OUTPUT PRINT-FILE.
		   
		0100-PROCESS-RECORDS.
		
		   PERFORM 0110-WRITE-HEADING-LINE.
		   READ USERSFILE
				AT END SET ENDOFUSERS TO TRUE
				END-READ.
		   PERFORM UNTIL ENDOFUSERS
			ADD YEARLYUSERS TO WS-TOTAL-USERS
			MOVE LASTNAME TO DET-LNAME
			MOVE FIRSTNAME TO DET-FNAME
			MOVE REGION TO DET-REGION
			MOVE YEARLYUSERS TO DET-YEARLYUSERS
			PERFORM 0120-WRITE-DETAIL-LINE
				
			READ USERSFILE 
			AT END SET ENDOFUSERS TO TRUE
            END-READ
		   END-PERFORM.
		   PERFORM 0130-WRITE-TOTAL-LINE.
		   DISPLAY "TOTAL USERS: ".
		   DISPLAY TOTAL-USERS.
		   CLOSE USERSFILE.
		   CLOSE PRINT-FILE.
		  
		0110-WRITE-HEADING-LINE.		  
			MOVE HEADING-LINE TO PRINT-LINE.
			WRITE PRINT-LINE AFTER ADVANCING PAGE.
			MOVE SPACES TO PRINT-LINE.
			WRITE PRINT-LINE.
			
		0120-WRITE-DETAIL-LINE.		  
			MOVE DETAIL-LINE TO PRINT-LINE.
			WRITE PRINT-LINE AFTER ADVANCING PAGE.
		
			
		0130-WRITE-TOTAL-LINE.		  
			MOVE TOTAL-LINE TO PRINT-LINE.
			WRITE PRINT-LINE AFTER ADVANCING PAGE.
	
           STOP RUN.
           
          END PROGRAM USERS.
