       IDENTIFICATION DIVISION.
       PROGRAM-ID. INSERTEMPLOYEES.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT EMPLOYEEFILE ASSIGN TO "EMPLOYEEFILE.DAT"
        FILE STATUS IS FILE-CHECK-KEY
		ORGANIZATION IS LINE SEQUENTIAL.
		
       SELECT TRANSFILE ASSIGN TO "EMPTRANS.DAT"
        FILE STATUS IS FILE-CHECK-KEY2
        ORGANIZATION IS LINE SEQUENTIAL.		
       
       SELECT NEWEMPFILE ASSIGN TO "EMPFILE.NEW"
        ORGANIZATION IS LINE SEQUENTIAL.
		
	   SELECT OUTPUTFILE ASSIGN TO "ERRORREPORT.LPT"
 		ORGANIZATION IS LINE SEQUENTIAL.   
          
               
       DATA DIVISION.
       FILE SECTION.
	   FD EMPLOYEEFILE.
	   01 EMPDETAILS.
			88 ENDOFFILE VALUE HIGH-VALUES.
			02 EMPID  	     PIC 9(7).
            02 FILLER        PIC X(38).

       FD TRANSFILE.			
	   01 EMPTRANS.
			88 ENDOFFILE2 VALUE HIGH-VALUES.
			02 NEWEMPID  	 PIC 9(7).
			02 FILLER        PIC X(38).
		
       FD NEWEMPFILE.			
	   01 NEWEMPRECORD       PIC X(45).
					
       FD OUTPUTFILE.
	   01 PRINTLINE.
	      02 FILLER          PIC X(132).
   
       WORKING-STORAGE SECTION.
       01  WS-WORKING-STORAGE.
           05 FILLER      PIC X(27) VALUE 
		      'WORKING STORAGE STARTS HERE'.
     
       01  WS-DATE.
           05  WS-YEAR PIC 99.
           05  WS-MONTH PIC 99.
           05  WS-DAY   PIC 99.
		   
	   01  WS-WORK-AREAS.
	       05  WS-SALARY-TOTAL  PIC 9(12) VALUE ZERO. 
           05  FILE-CHECK-KEY   PIC X(2).
		   05  FILE-CHECK-KEY2  PIC X(2).

       01  HEADING-LINE.

            05 FILLER	        PIC X(22)  VALUE 
			   'DUPLICATE ERROR REPORT'.
			05 FILLER           PIC X(110)  VALUE SPACES.

			
		01  DETAIL-LINE.
			05 DET-EMP-ID       PIC 9(7).
			05 FILLER           PIC X(125) VALUE SPACES.


       PROCEDURE DIVISION.
       0100-READ-EMPLOYEES.

		   OPEN INPUT EMPLOYEEFILE
           IF FILE-CHECK-KEY NOT = "00"
		      DISPLAY "ERR: OPEN FILE ERROR EMPFILE ",
				 FILE-CHECK-KEY
		      GO TO 9000-END-PROGRAM
		   END-IF.
		   OPEN INPUT TRANSFILE
		   IF FILE-CHECK-KEY2 NOT = "00"
		      DISPLAY "ERR: OPEN FILE ERROR TRANSFILE ",
			     FILE-CHECK-KEY2
		   END-IF.	 
		   OPEN OUTPUT OUTPUTFILE.
		   WRITE PRINTLINE FROM HEADING-LINE
		     AFTER ADVANCING 2 LINES.
			 
		   OPEN OUTPUT NEWEMPFILE.
		   
		   READ EMPLOYEEFILE
			AT END SET ENDOFFILE TO TRUE
			END-READ.
			
		   READ TRANSFILE 
		    AT END SET ENDOFFILE2 TO TRUE
			END-READ.
			
		   PERFORM 0200-PROCESS-EMPLOYEES UNTIL 
		      (ENDOFFILE) AND (ENDOFFILE2).
		   		   
		   PERFORM 9000-END-PROGRAM.
		   
	   0100-END.
	   
	   0200-PROCESS-EMPLOYEES.
	        EVALUATE TRUE
			  WHEN(EMPID<NEWEMPID)
			    WRITE NEWEMPRECORD FROM EMPDETAILS
				  READ EMPLOYEEFILE 
				    AT END SET ENDOFFILE TO TRUE
				  END-READ
				  
			  WHEN (EMPID>NEWEMPID)
			    WRITE NEWEMPRECORD FROM EMPTRANS 
				  READ TRANSFILE
				    AT END SET ENDOFFILE2 TO TRUE
			      END-READ 
				  
			  WHEN (EMPID = NEWEMPID)
                 MOVE EMPID TO DET-EMP-ID  
                    WRITE PRINTLINE FROM DETAIL-LINE
                    READ TRANSFILE
                      AT END SET ENDOFFILE2 TO TRUE
                    END-READ					  
		    END-EVALUATE.
		  
	   0200-END. 
	   
	   
	   9000-END-PROGRAM.
           CLOSE EMPLOYEEFILE.	
		   CLOSE TRANSFILE.
           CLOSE NEWEMPFILE.		   
           CLOSE OUTPUTFILE.	   
           STOP RUN.
           
          END PROGRAM INSERTEMPLOYEES.
