       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMACSVS.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	  SELECT COMMADELIMITED ASSIGN TO "COMMACSVS.csv"
		ORGANIZATION IS LINE SEQUENTIAL.
          
               
       DATA DIVISION.
       FILE SECTION.
	   FD COMMADELIMITED.
	   01 FILEDETAILS.
			88 ENDOFFILE VALUE HIGH-VALUES.
			02 DETAILS  	 PIC X(110).
			
			
       WORKING-STORAGE SECTION.   
	   01  WS-WORKING-STORAGE.
	       05  FILLER  PIC X(27) VALUE 
		       'WORKING STORAGE STARTS HERE'.
		
           05  SHORT-DESC    PIC X(19).
           05  MOVIENAME     PIC X(20).
		   05  ISSUE-NUMBER  PIC 9(6).
		   05  TIMECODE      PIC X(13).
           05  DECISION		 PIC X(20). 

           05  STRINGEND     PIC 99.		   
		   
	     01  WS-REPORT-TITLE.
           05  FILLER     PIC X(20) VALUE SPACES.
           05  FILLER     PIC X(33) 
		        VALUE 'COMMA DELIMITED FILE EXAMPLE'.		   
     

	   01  WS-DETAIL-LINE.
           05  WS-SHORT-DESC    PIC X(19).
		   05  FILLER        PIC XX.
           05  WS-MOVIENAME     PIC X(20).
		   05  FILLER        PIC XX.
		   05  WS-ISSUE-NUMBER  PIC 9(6).
		   05  FILLER        PIC XX. 
		   05  WS-TIMECODE      PIC X(13).
		   05  FILLER        PIC XX.
           05  WS-DECISION		 PIC X(20).  
	

       PROCEDURE DIVISION.
       
	   0100-BEGIN.
		    
		   OPEN INPUT COMMADELIMITED.
		   READ COMMADELIMITED
			AT END SET ENDOFFILE TO TRUE
			END-READ.
		   DISPLAY WS-REPORT-TITLE.
		   DISPLAY ' '.
		   
           PERFORM 0200-PROCESS-RECORDS UNTIL ENDOFFILE.
		 
		   PERFORM 0300-STOP-RUN.
	   
	   0200-PROCESS-RECORDS.
	       
		   PERFORM VARYING STRINGEND FROM 110 BY -1
              UNTIL DETAILS(STRINGEND:1) NOT = SPACE
		   END-PERFORM.
			  
           UNSTRING DETAILS(1:STRINGEND) DELIMITED BY ","
             INTO SHORT-DESC       
                  MOVIENAME
                  ISSUE-NUMBER
				  TIMECODE
                  DECISION
           END-UNSTRING.
		   
		   MOVE SHORT-DESC TO WS-SHORT-DESC.
		   MOVE MOVIENAME TO WS-MOVIENAME.
		   MOVE ISSUE-NUMBER TO WS-ISSUE-NUMBER.
		   MOVE TIMECODE TO WS-TIMECODE.
		   MOVE DECISION TO WS-DECISION.
		   DISPLAY WS-DETAIL-LINE.
		   DISPLAY ' '.
		   READ COMMADELIMITED 
			 AT END SET ENDOFFILE TO TRUE
		   END-READ.
	   
	   0200-END.
	   
	   0300-STOP-RUN.	
		
           CLOSE COMMADELIMITED.		
           STOP RUN.
           
          END PROGRAM COMMACSVS.
